[
  {
    "slug": "https://thecryptobasic.com/?p=148642",
    "title": "Cardano Founder Says Gemini Lost Over $70 Million by Not Listing ADA",
    "link": "https://thecryptobasic.com/2025/12/31/cardano-founder-says-gemini-lost-over-70-million-by-not-listing-ada/",
    "date": "2025-12-31",
    "content": "Cardano founder Charles Hoskinson has criticized Gemini for refusing to list ADA, arguing that the decision cost the platform $70 million in lost revenue. Speaking in an interview with Blockchain Daily, Hoskinson highlighted Gemini as the only major crypto exchange that does not support ADA, despite the token’s widespread adoption and popularity. Visit Website",
    "image": "https://resources.cryptocompare.com/news/65/56638325.jpeg",
    "source": "The Crypto Basic"
  },
  {
    "slug": "2025-12-18",
    "title": "Kalshi Integrates TRON Network, Expanding Onchain Liquidity Access for World’s Largest Prediction Market",
    "date": "2025-12-18",
    "image": "https://www.tbstat.com/cdn-cgi/image/f=avif,q=80/wp/uploads/2025/12/Screenshot-2025-12-17-at-3.39.08%E2%80%AFPM-1200x675.png",
    "content": "Geneva, Switzerland – December 18, 2025 – TRON DAO, the community-governed DAO dedicated to accelerating the decentralization of the internet through blockchain technology and decentralized applications (dApps), today announced that Kalshi, the world’s largest prediction market platform, has integrated the TRON blockchain network. This integration enables seamless deposits and withdrawals using TRX, the native utility token of the TRON network, and USDT on TRON, expanding Kalshi’s multichain infrastructure by providing additional liquidity pathways for global market participants while bridging traditional finance with blockchain infrastructure. \n\n                    The integration positions TRON as a critical component in Kalshi’s expansion beyond traditional finance rails into the blockchain economy. Domestic account holders can now directly deposit and withdraw native TRX and USDT on TRON, while international users can leverage the integration through connected exchange accounts. This development combines TRON’s proven scale and efficiency with Kalshi’s innovative prediction market infrastructure to unlock new channels for onchain liquidity to flow seamlessly into real-world event trading markets. \n\n                    “The collaboration between Kalshi and TRON demonstrates the growing convergence between traditional financial markets and blockchain infrastructure,” said Sam Elfarra, Community Spokesperson at the TRON DAO. “As the world’s largest prediction market embraces multichain capabilities, TRON’s speed, scalability, and dynamic ecosystem provide the ideal foundation for new pathways to liquidity.” \n\n                    Three-second block times and near-zero transaction fees create an optimal environment for seamless movement of funds between the world’s largest prediction market and TRON’s proven blockchain ecosystem, which is trusted by institutions and users worldwide.\n\n                    “TRON’s integration strengthens Kalshi’s multichain vision of maximizing accessibility,\" said John Wang, Head of Crypto at Kalshi. “With TRON processing over $24 billion in daily transfer volume and hosting more that $80 billion in circulation USDT, the network brings deep stablecoin liquidity to Kalshi’s platform.”\n\n                    The collaboration reflects a broader industry trend toward blockchain integration among traditional financial platforms seeking enhanced efficiency, global accessibility, and reduced settlement friction. TRON's established infrastructure, spanning over 350 million user accounts and processing more than 12 billion total transactions, provides Kalshi with immediate access to one of the most actively used blockchain networks worldwide. This scale enables Kalshi to tap into global liquidity pools while maintaining the speed and cost-efficiency required for active market participation.\n\n                    As both cryptocurrency and prediction markets gain mainstream adoption and regulatory clarity, the integration of blockchain infrastructure becomes increasingly critical for enabling global participation and efficient capital movement. TRON’s proven capability in handling institutional-scale transaction volumes, combined with its dominance in stablecoin infrastructure, positions both platforms at the forefront of the evolving intersection between traditional markets and decentralized finance.",
    "source": "legacy"
  },
  {
    "slug": "2025-10-03",
    "title": "The Daily: Samsung partners with Coinbase to enable crypto funding via Pay, Walmart-backed OnePay to launch BTC and ETH trading, and more",
    "date": "2025-10-03",
    "image": "https://www.tbstat.com/cdn-cgi/image/f=avif,q=80/wp/uploads/2025/10/samsung-news-1200x675.jpg",
    "content": "Happy Friday! October is living up to its bullish reputation so far — bitcoin has posted gains this month in 10 of the past 12 years, and it's already up 9% in the first few days.\n\n                    In today’s newsletter, Samsung partners with Coinbase to enable crypto funding via Samsung Pay on Galaxy devices. Plus, Walmart-backed OnePay plans to launch BTC and ETH trading and custody services, the stablecoin market cap surpasses $300 billion for the first time, and more.\n\n                    Meanwhile, bitcoin miners MARA, Cango, CleanSpark, and Riot all release their latest monthly production updates.\n\n                    Let's get started!\n\n                    P.S. CryptoIQ is now available to everyone. Take the test for a chance to win $20,000!",
    "source": "legacy"
  },
  {
    "slug": "2025-07-07",
    "title": "TON Foundation says UAE ‘Golden Visa’ plan in early stages after government pushback",
    "date": "2025-07-07",
    "image": "https://www.tbstat.com/cdn-cgi/image/f=avif,q=80/wp/uploads/2024/05/20240506_TON_News_2-1200x675.jpg",
    "content": "The Open Network (TON) Foundation clarified details about its 10-year \"Golden Visa\" program for certain Toncoin stakers, stating that the initiative is still in its infancy and has not yet been launched in collaboration with the United Arab Emirates (UAE) government. \n\n                    \"To clarify, no official Golden Visa program has launched in partnership with the government of the United Arab Emirates, nor has any governmental endorsement been granted to TON,\" the TON Foundation wrote in a Monday release. \n\n                    \"This collaboration is in the early stages of development. It reflects a broader effort to explore how compliant, blockchain-based frameworks might eventually support real-world access to residency pathways. Any offering would be subject to all applicable laws and regulations,\" the foundation said. \"Application alone does not guarantee visa issuance, the authority for which remains at the discretion of the relevant UAE government bodies.\"\n\n                    On July 6, the TON Foundation, the independent organization overseeing the Telegram-focused blockchain network TON, announced the UAE Golden Visa program for investors who stake $100,000 in Toncoin (TON) for three years and pay a $35,000 processing fee for a 10-year visa to the UAE.\n\n                    Peravel, a crypto-native travel firm and the program's partner, said at the time that UAE officials retain final approval over all visa applications. The UAE government also noted that digital currency investments are subject to separate rules and do not qualify for Golden Visa eligibility, The Block previously reported.",
    "source": "legacy"
  },
  {
    "slug": "2025-05-18",
    "title": "Blum co-founder, ex-Binance exec Vladimir Smerkis arrested in Moscow on fraud charges",
    "date": "2025-05-18",
    "image": "https://www.tbstat.com/cdn-cgi/image/f=avif,q=80/wp/uploads/2020/06/20200601_TON-Telegram-Genesis-1200x675.jpg",
    "content": "The co-founder of Blum, a popular Telegram Mini App that combines a crypto exchange with point-earning games, has been detained in Russia on accusations of large-scale fraud, according to local media reports. \n\n                    Vladimir Smerkis, who previously worked as the general manager for Binance's operations in Russia and the CIS region, was arrested on Friday Zamoskvoretsky District Court of Moscow, according to local media site TASS. Police told TASS Smerkis was arrested \"...as part of a criminal case on fraud on an especially large scale,\" though the official charges have yet to be revealed. \n\n                    Some reports suggest the arrest could be related to prior projects Smerkis led, including The Token Fund and Tokenbox, which raised millions but have since faded into obscurity. \n\n                    Following the arrest, Blum was quick to put distance between the project and Smerkis. Blum's X account announced on Saturday that Smerkis \"...has stepped down from his role as CMO and is no longer involved in the development of the project or in any co-founder capacity.\"",
    "source": "legacy"
  },
  {
    "slug": "2025-03-03",
    "title": "Trump’s Crypto Czar David Sacks says he sold crypto holdings before administration began",
    "date": "2025-03-03",
    "image": "https://www.tbstat.com/cdn-cgi/image/f=avif,q=80/wp/uploads/2024/07/20240715_Trump_News_2-1200x675.jpg",
    "content": "David Sacks, the first-ever AI and Crypto Czar for the White House, confirmed on X that he sold his cryptocurrency holdings prior to the start of the Trump administration.\n\n                    \"Correct. I sold all my cryptocurrency (including BTC , ETH, and SOL) before the start of the administration,\" Sacks wrote on X on Sunday, reposting a screenshot of a Financial Times report. The report highlighted potential conflicts of interest and cited a source saying Sacks had sold his crypto holdings.\n\n                    Sacks' comment came in response to concerns emerging online over potential conflicts of interest regarding Sacks' ties to Bitwise, which offers an exchange-traded fund that invests in Bitcoin, Ethereum, XRP, Solana and Cardano, among other tokens. Sacks founded Craft Ventures, which retains stakes in crypto startups, including Bitwise.\n\n                    The Financial Times reported, citing a source familiar with the matter, that Sacks is undergoing an official ethics review and will disclose updates on his crypto holdings later.\n\n                    In response to an X community note claiming that Sacks has indirect crypto holdings from investing in Bitwise, he refuted the claims. \"This community note is a lie. I had a $74k position in the Bitwise ETF which I sold on January 22. I do not have 'large indirect holdings,'\" Sacks said. \"I’ll provide an update at the end of the ethics process.\"\n\n                    On Sunday, U.S. President Donald Trump said on social media that his planned \"Crypto Strategic Reserve\" will include Bitcoin and Ether and that he has directed his crypto working group to “move forward” on a reserve consisting of SOL, XRP and ADA.\n                    \n                    \"President Trump has announced a Crypto Strategic Reserve consisting of Bitcoin and other top cryptocurrencies,\" Sacks also wrote on X. \"This is consistent with his week-one E.O. 14178. President Trump is keeping his promise to make the U.S. the 'Crypto Capital of the World.' More to come at the Summit.\"\n\n                    Trump's posts about crypto reserves have sparked a rally in the crypto market, with tokens like XRP and ADA posting large daily gains.\n\n                    Trump will address crypto industry leaders at the inaugural Crypto Summit at the White House on March 7.",
    "source": "legacy"
  },
  {
    "slug": "2025-01-16",
    "title": "Illicit use of blockchains represents just 0.4% of total crypto volume, TRM Labs finds",
    "date": "2025-01-16",
    "image": "https://www.tbstat.com/cdn-cgi/image/f=avif,q=80/wp/uploads/2024/06/tron-thumbnail-1200x675.png",
    "content": "Crypto crime is dropping, and nowhere faster than on blockchain often called out for illicit use, TRON, according to a preview of TRM Labs’ 2024 Crypto Crime Report.\n\n                    Illicit onchain volume is down 24% since 2023 to $45 billion, according to the blockchain intelligence company, and represents just 0.4% of overall crypto transactions. This is despite crypto transaction volume growing 56% last year to over $10.6 trillion.\n\n                    The firm attributes this drop to increased efforts to curb illegal activities by law enforcement and crypto industry participants.\n\n                    Nowhere is this more apparent than on TRON, the blockchain founded by prominent founder Justin Sun which recently launched a partnership looking to “identify and disrupt criminal networks” alongside USDT and TRM Labs.\n\n                    Together with law enforcement agencies around the world, the so-called T3 Financial Crime Unit claims to have frozen around $130 million USDT worth of assets connected to suspected crimes, the group announced earlier this month. The group has monitored over $3 billion worth of USDT transactions since spinning up in August.\n\n                    This strategy has appeared to pay off, as TRM Labs now says illicit use of TRON is falling fast. “TRON experienced the most significant decline in illicit activity, with illicit volume dropping by $6 billion and the proportion of such activity nearly halving,” the company wrote.\n\n                    That said, TRON remains the most-used blockchain for criminal activity. According to the same report, TRON accounts for 58% of total illicit volume compared to 24% on Ethereum and 12% on Bitcoin, which “reflects a continued preference for blockchains that have low transaction fees, smart contracts and popular stablecoins.”",
    "source": "legacy"
  },
  {
    "slug": "2024-11-26",
    "title": "Tron founder Justin Sun named advisor to Trump-backed World Liberty Financial following $30 million investment",
    "date": "2024-11-26",
    "image": "https://www.tbstat.com/cdn-cgi/image/f=avif,q=80/wp/uploads/2019/07/Justin-Sun-getty-1200x675.jpg",
    "content": "World Liberty Financial, the Aave fork backed by President-elect Donald Trump’s friends and family, announced on Tuesday that it is appointing TRX founder Justin Sun as an advisor. \n\n                    The news comes a day after HTX, the crypto exchange formerly known as Huobi and closely associated with Sun, invested $30 million in World Liberty, according to onchain data. \n\n                    “We are thrilled to invest $30 million in World Liberty Financial @worldlibertyfi as its largest investor,” Sun said in a pinned post on X. “The U.S. is becoming the blockchain hub, and Bitcoin owes it to @realDonaldTrump! TRON is committed to making America great again and leading innovation. Let's go!”\n\n                    World Liberty Financial, a decentralized lending platform launched in September 2024, is one of Trump’s largest steps into the crypto world to date. Formerly a skeptic, the incoming U.S. president has aligned himself with crypto interests in recent months and signaled he would curtail the tight regulation of digital assets in the country. \n\n                    Although highly anticipated, the sale of World Liberty’s governance tokens has been off to a rough start. The project initially aimed to sell $300 million worth of tokens but rolled that back to $30 million in late October after seeing lackluster support. \n\n                    According to the latest filings, World Liberty sold only $21 million worth of WLFI tokens prior to Sun's purchase on Monday. The sale was limited to non-U.S. and qualified U.S. investors.",
    "source": "legacy"
  },
  {
    "slug": "2024-10-21",
    "title": "TRON DAO Supports Princeton Blockchain Club’s Crypto TigerTrek as Ruby Sponsor",
    "date": "2024-10-21",
    "image": "https://www.tbstat.com/cdn-cgi/image/f=avif,q=80/wp/uploads/2024/10/Screenshot-2024-10-21-at-7.13.02%E2%80%AFAM-1197x675.png",
    "content": "Geneva, Switzerland, October 21, 2024 – TRON DAO participated as a Ruby Sponsor at Princeton Blockchain Club’s 3rd Annual Crypto TigerTrek, a novel Princeton experience that brought together students and industry professionals for a week filled with discussions, networking, and educational sessions, all focused on the evolving landscape of blockchain technology.\n                    TRON DAO has collaborated with top academic institutions through initiatives like the TRON Builder Tour, which has visited universities such as MIT, Harvard, and Columbia. Princeton was another important stop in TRON’s mission to mentor the next generation of blockchain developers and leaders.\n                    A Platform for Collaboration and Innovation\n                    As part of this event, Steven Bischoff, TRON Community Spokesperson, delivered a keynote to Princeton students. In his address, he emphasized the essential skills required to succeed in the cryptocurrency industry, along with providing a comprehensive overview of how to effectively communicate, navigate, and build collaborations within the industry.\n                    The keynote also provided an overview of TRON’s robust ecosystem and stablecoin solutions are driving adoption within emerging markets, showcasing real-world applications of blockchain technology in various industries.",
    "source": "legacy"
  },
  {
    "slug": "2024-07-15",
    "title": "Trump’s VP pick J.D. Vance owns over $100,000 in bitcoin",
    "date": "2024-07-15",
    "image": "https://www.tbstat.com/cdn-cgi/image/f=avif,q=80/wp/uploads/2024/05/20240528_Trump_News_1-1200x675.jpg",
    "content": "J.D. Vance, the venture capitalist turned politician tapped as running mate by former President Donald Trump, owns between $100,001 and $250,000 in bitcoin, according to his latest federal financial disclosure.\n\n                    The Ohio Senator disclosed that he held those bitcoin on Coinbase in his mandated Annual Report for the calendar year 2022 filed in October 2023. Vance also maintained accounts on brokerages Robinhood and Charles Schwab.\n\n                    Vance also reported income of $110,146 from his Cincinnati-based Narya Capital Management firm and $121,376 in royalties from HarperCollins from his bestselling 2016 memoir “Hillbilly Elegy.”\n\n                    The vice presidential candidate has not yet filed financial disclosures for 2023. His current estimated net worth is at least $5 million and as much as $10.5 million, according to Cincinnati.com.\n\n                    He is known to be one of the more pro-crypto legislative representatives and is drafting a bill that will reform how financial regulators police digital assets in the U.S.",
    "source": "legacy"
  },
  {
    "slug": "2024-05-29",
    "title": "BlackRock files amended S-1 registration statement for upcoming Ethereum ETF with more disclosures",
    "date": "2024-05-29",
    "image": "https://www.tbstat.com/cdn-cgi/image/f=avif,q=80/wp/uploads/2022/10/20221005_Blackrock2-1200x675.jpg",
    "content": "BlackRock filed an amended registration statement for its proposed Ethereum fund, marking the latest move as firms work to list and trade their products. \n\n                    The world's largest asset manager filed its amended S-1 registration statement almost a week after the U.S. Securities and Exchange Commission approved 19b-4 forms for eight Ethereum ETFs, including BlackRock's proposed iShares Ethereum Trust. Issuers still need their S-1 statements to become effective before trading can begin. \n\n                    In the amended form, BlackRock disclosed information about its seed capital investor. \n\n                    \"On May 21, 2024, the Seed Capital Investor, an affiliate of the Sponsor, subject to conditions, purchased the Seed Creation Baskets, comprising 400,000 Shares at a per-Share price equal to $25.00,\" BlackRock said in the revised filing, meaning the seed investment was $10 million. The asset manager also said the shares will be listed and traded under the ticker symbol \"ETHA.\"",
    "source": "legacy"
  },
  {
    "slug": "2024-04-29",
    "title": "P2P.org Joins TRON Network as Newest Super Representative",
    "date": "2024-04-29",
    "image": "https://www.tbstat.com/cdn-cgi/image/f=avif,q=80/wp/uploads/2025/04/Screenshot-2025-04-29-at-7.48.43%E2%80%AFAM-1195x675.png",
    "content": "George Town, Grand Cayman, Cayman Islands - April 29, 2025 - P2P.org, a leading validation and staking provider across multiple blockchain networks, has been officially elected as a TRON Super Representative (SR), supporting TRON’s mission to decentralize the internet through blockchain technology. This strategic integration strengthens TRON’s infrastructure and expands P2P.org’s validation services to over 40 supported networks.\n\n                    Founded in 2018, P2P.org provides non-custodial infrastructure and technology for intermediaries such as Web3 wallets, exchanges, and custodians. Their dynamic approach enables participants to achieve rapid growth by running nodes without managing the underlying technical complexities.\n\n                    As a newly elected Super Representative, P2P.org will assist with validating transactions, producing blocks, and maintaining network security while creating pathways for institutions to access incentives on the TRON network.\n\n                    \"With its scalability and minimal transaction costs, TRON has become the blockchain of choice for an increasing number of DeFi platforms focused on institutional adoption,” said Sam Elfarra, Community Spokesperson for the TRON DAO. “As the builders of a thriving ecosystem with hundreds of institutional clients, we are thrilled to welcome P2P.org as a Super Representative.\" \n\n                    What is a Super Representative on the TRON Network?\n\n                    TRON's Super Representatives are 27 elected validators forming the backbone of the network's Delegated Proof-of-Stake (DPoS) consensus by producing blocks every three seconds, validating transactions, and voting on governance decisions.\n\n                    \"Becoming a TRON Super Representative Validator represents a significant advancement in our validator portfolio,\" said Alex Esin, CEO at P2P.org. \"This expansion strengthens our position across more than 40 networks and creates valuable new opportunities for our institutional partners to optimize their TRX holdings with industry-leading staking solutions.\"\n\n                    Read more about the Super Representatives, including P2P.org, on Tronscan.",
    "source": "legacy"
  },
  {
    "slug": "2024-02-20",
    "title": "HackaTRON season 6 launches on Feb. 20 and up to $650,000 in prizes",
    "date": "2024-02-20",
    "image": "https://www.tbstat.com/cdn-cgi/image/f=avif,q=80/wp/uploads/2024/02/HackaTHON.png",
    "content": "TRON DAO, along with co-hosts HTX DAO, BitTorrent Chain, and JustLend DAO, proudly announces HackaTRON Season 6, spanning from February 20 to June 28, 2024. This season stands out due to its collaborative spirit and support from our sponsors, each bringing unique value to the blockchain space.\n\n                    Track Details \n\n                    HackaTRON Season 6 contains five different tracks:\n\n                    Web3: Shape the next evolution of the internet with contributions that bridge the gap to a decentralized future.\n\n                    Artistry: Redefine entertainment by merging blockchain technology with gaming and NFTs, exploring new horizons for creators.\n\n                    DeFi: Craft the next DeFi project that makes financial services more accessible.\n\n                    Builder: For returning projects on TRON/BTTC that have significant updates.\n\n                    Integration (NEW): A new track inviting the integration of protocols, dApps, or services to enrich the TRON ecosystem. It's an open call for developers to leverage the TRON network’s capabilities.\n\n                    Prize Pool Details\n\n                    Season 6 boasts a prize pool of up to $650,000*, featuring $500,000 in TRX, the TRON network’s native utility token, for regular prizes and $150,000* in energy prizes. The energy component subsidizes network fees, facilitating smoother and more efficient blockchain interactions for users. The prize distribution among judge and community voting per track is as follows:\n\n                    Judge-Selected Qualifiers \n\n                    1st Place: $25,000 in TRX*\n\n                    2nd Place: $15,000 in TRX*\n\n                    3rd Place: $10,000 in TRX*\n\n                    4th Place: $8,000 in TRX*\n\n                    5th Place: $6,000 in TRX*\n\n                    Community-Selected Winners\n\n                    1st Place: $7,000 in TRX*\n\n                    2nd Place: $6,000 in TRX*\n\n                    3rd Place: $5,000 in TRX*\n\n                    4th Place: $4,000 in TRX*\n\n                    5th Place: $3,000 in TRX*",
    "source": "legacy"
  }
]
