[
  {
    "slug": "https://seekingalpha.com/article/4856511-western-union-stock-10-percent-dividend-is-now-reinforced-by-clever-crypto-strategy?utm_source=cryptocompare.com&utm_medium=referral&feed_item_type=article",
    "title": "Western Union's 10% Dividend Is Now Reinforced By A Clever Crypto Strategy",
    "link": "https://seekingalpha.com/article/4856511-western-union-stock-10-percent-dividend-is-now-reinforced-by-clever-crypto-strategy?utm_source=cryptocompare.com&utm_medium=referral&feed_item_type=article",
    "date": "2025-12-31",
    "content": "Summary Western Union remains deeply undervalued at a 5x forward earnings multiple, despite robust 18% margins and a well-covered 10% dividend yield. WU's core business efficiency is improving, evidenced by a $150M cost-saving program completed two years early and signs of margin expansion as a result. Management’s stablecoin initiative, USDPT, is much more promising than was initially apparent, with the potential to generate interest on float and reduce banking fees. Investment Thesis My last article on Western Union ( WU ), back in July, emphasized my serious concern about the company’s new strategic focus on developing a stablecoin cryptocurrency. In recent months, however, a more detailed outline of this project has been revealed by the firm , giving me more confidence in its potential utility for the company, even though some risks remain. I also think it is worth continuing to emphasize that Western Union has returned value to shareholders very effectively in recent years via dividends and buybacks. There is recent evidence that suggests it is becoming more efficient too, allowing it to maintain its strong margins. Overall, in consideration of its persistent extreme undervaluation, represented by its 5x earnings multiple, I remain confident in assigning a buy rating to the stock. Core Business Operations In my last article I argued that Western Union needed to focus on its core business rather than getting distracted with a potentially fruitless crypto venture. For those who haven’t read my previous articles, I should make clear that this core business involves a network of 360,000 physical locations, which can be used to send and receive money internationally. While money transfers are a competitive business, Western Union’s agent network is, in my view, its most significant competitive advantage, because it allows people to send and receive physical cash (though digital options are also supported). This support for cash is useful for both migrant labourers working overseas and sending money home (who are often paid in cash) and also for their families, who may live in areas without banking infrastructure where \"cash is king.\" Slide from \"Beyond\" Strategy Presentation -- November 6th 2025 (Western Union) It is very encouraging to see that the firm does seem to be following the main proposal from my previous article in that they are now focusing effectively on making core business operations more efficient. This is shown by having completed a $150 million cost-saving program two years ahead of schedule. Efficiency also comes from having better KYC and due diligence processes, which can be highly frictional if done poorly, resulting in poor customer retention. While legal compliance is essential in order that the firm avoid fines and regulatory sanctions, it is good that the firm seems to be recognizing that customer service agents interrogating senders on the reasons for their transfers (especially when a language barrier is possible) is a sub-optimal experience. Making these sorts of processes more efficient not only saves money on the back end but can also lead to customers being happier with a transfer experience that is faster and more seamless. Slide from \"Beyond\" Strategy Presentation -- November 6th 2025 (Western Union) This cost reduction program also seems to have already fed through into margins, where in the most recent quarter we saw a quarter-on-quarter increase after an extended period of worrying declines, as shown below. In legacy businesses like Western Union, where revenues can gradually decline year-on-year, it is of particular importance that margin compression does not occur. Signs of this trend reversing are very encouraging. Data by YCharts Questionable Initiatives Where developments are perhaps less encouraging is outside the core business. Management is determined that the firm become a \"full-service digital platform,\" which means investing in areas that I view as offering little appeal to the typical remitter and their family. While there are perhaps opportunities in prepaid cards, digital wallets, affiliate offers, bill payment, and loyalty, the company should arguably not spend money and effort developing business segments where interest from consumers is limited. Slide from \"Beyond\" Strategy Presentation -- November 6th 2025 (Western Union) To give one example shown above, from a recent investor presentation, we have \"Morocco Rewards.\" Among 1.3 million transactions sent to Morocco, we are told that \"thousands\" of rewards have been successfully redeemed. Since I understand \"thousands\" to mean anywhere in the range of 1,000 to 9,999, this is not a particularly helpful figure. Putting that to one side, within that range, we could have anywhere between 0.07% and 0.77% of transactions having some reward being claimed. Neither figure seems to demonstrate that Moroccans are particularly enthused by the firm’s loyalty scheme. It’s also worth keeping in mind that this is the example Western Union has chosen to present, so there is the possibility that loyalty schemes in other countries are even less effective. Overall, I think that there is definite positive evidence of the core business being optimized, but shareholders should monitor how much attention is being paid to initiatives that are unlikely to move the needle on shareholder returns, as these might be seen as reflecting a management strategy that, while having some strengths, is not totally coherent. Stablecoin Clarity This brings us to a project that was initially announced in rather vague terms, provoking my overall crypto-skepticism, having briefly worked in that industry. My initial concern was that Western Union developing a crypto product, which often emphasizes low fees, would be at best cannibalistic to the firm’s existing business and at worst a margin destroyer. Slide from \"Beyond\" Strategy Presentation -- November 6th 2025 (Western Union) I am happy to say that I am now slightly less pessimistic about the overall crypto project, having seen the recent detail on that shared with us by management. We now know that USDPT will be built on the Solana blockchain and that the stablecoin will be underwritten by Anchorage Digital Bank, currently the only crypto-native bank with a federal charter in the United States. This gives USDPT a level of security and built-in regulatory compliance, which is encouraging. It is also useful to see a more detailed justification for why a dedicated Western Union token (USDPT) specifically needs to exist versus supporting some other stablecoin. At the recent Investor Day, Ben Hawksworth, COO, explained that this solution \"allows us to better capture economics by earning float for the long term.\" Many may recognize the term \"float\" from Warren Buffett’s Berkshire Hathaway’s insurance operations. In the context of Western Union, based on my interpretation of management comments, it can be understood as the liquidity that needs to be set aside to honor transactions (also known as \"pre-funding\") in the various jurisdictions where Western Union operates. Now, rather than these funds being held in correspondent banks around the world, USDPT will allow Western Union to avoid bank fees and perhaps even earn a modest interest on this freed-up capital. It is also worth briefly mentioning the consumer side of USDPT, where customers will be able to hold and spend the stablecoin via prepaid cards. While this is unlikely to appeal to those in underbanked and physical cash-focused areas, there is a definite appeal to being able to own what are effectively US dollars in places where high inflation is an issue (Argentina being one example). Slide from \"Beyond\" Strategy Presentation -- November 6th 2025 (Western Union) While I’m overall a lot more positive about the crypto business, it’s important not to ignore the risks associated with cryptocurrencies broadly. Firstly, there is always the possibility of hacks and security vulnerabilities associated with cryptocurrencies. Investors should consider a bet on USDPT to be also a bet on the integrity of Solana, the chain on which USDPT is built. The other big risk with crypto is regulation. Some jurisdictions have approaches that might challenge the use of USDPT, in some cases with limited warning and time for compliance, leaving funds trapped. Countries like India lack a coherent regulatory framework dealing with stablecoins, for example. India also levies a 1% tax on stablecoin transactions, and it's unclear how this might apply to USDPT. Internationally, some legislators are skeptical about cryptocurrency, and there is a chance USDPT could be affected by onerous legislation and taxes in the future. Valuation Considering my generally positive assessment of Western Union’s core business and my new optimism about its crypto initiative, it is extremely surprising that it continues to trade at such a low valuation. The forward price-to-earnings ratio of 5x is a particularly strong indicator of this undervaluation. Some might consider price-to-FCF to be a more robust metric, and the current figure of around 8x looks very low too, especially considering that free cash flow has been artificially depressed by tax settlement payments, which ended in the second quarter of this year. Data by YCharts Western Union’s dividend continues to be a major attraction for income-focused investors, and the good news is that it is well covered by earnings, as shown in the graph below. A well-covered 10% yield from a business that looks pretty far from bankruptcy represents a good deal from my view, especially considering positive catalysts such as a more efficient core business and the new crypto settlement backend, which is also likely to save (and even generate) money. Data by YCharts It is also important to remember that aggressive buybacks over the years mean that, despite declining revenues on the company level, each share now represents a greater stake in the business and its revenues, as illustrated by the revenue-per-share graph. It is difficult to argue that management is not shareholder-oriented, given their commitment to buybacks and dividends. Data by YCharts Conclusion When asked during Berkshire Hathaway’s 2012 Annual Meeting how to value a declining business, the late Charlie Munger (Warren Buffett’s business partner) answered that they are \"not worth nearly as much as growing businesses.\" By some measurements, particularly revenues over recent years, Western Union certainly looks like a declining business. However, it does seem clear to me that the market is being excessively pessimistic when it assigns a 5x forward earnings multiple to a business that enjoys 18% margins (and rising, thanks to greater efficiency), has a strong competitive advantage resulting from its cash-focused agent network, and may now be able to generate Buffett-style \"float\" interest through its crypto initiative.",
    "image": "https://resources.cryptocompare.com/news/50/56639485.jpeg",
    "source": "Seeking Alpha"
  }
]